/*****************************************************************************************
版权所有:        -----------------
版本号:            1.0.0
生成日期:        2009.09.09
文件名:            app_led.h
作者:            影舞者
功能说明:        应用配置文件
其它说明:        Atmel AT91SAM3U4-EK Evaluation Board
所属文件关系:    本文件为工程规约代码文件

修改记录:
记录1:
修改者:
修改日期:
修改内容:
修改原因:
*****************************************************************************************/

#ifndef APP_LED_PRESENT
#define APP_LED_PRESENT

#ifdef  APP_LED_GLOBALS    
    #define APP_LED_EXT
#else
    #define APP_LED_EXT    extern
#endif 




/*****************************************************************************************
版权所有:   影舞者
版本号:        1.0.0
生成日期:    2009.09.11
功能说明:   按键的值
其它说明:   无
*****************************************************************************************/
#define RED_LED                 (51)                        // 运行
#define BLUE_LED                (52)                        // 打印




/*********************************************************************************************************
  宏定义
*********************************************************************************************************/
#define LED_BLUE_PIN            GPIO_Pin_3                  // LED - PA.5 RED
#define LED_BLUE_PORT           GPIOB
#define LED_BLUE_PORT_CLK       RCC_AHBPeriph_GPIOB  

#define LED_RED_PIN             GPIO_Pin_6                  // LED - PA.5 BLUE
#define LED_RED_PORT            GPIOB
#define LED_RED_PORT_CLK        RCC_AHBPeriph_GPIOB  




/*****************************************************************************************
版权所有:   影舞者
版本号:     1.0.0
生成日期:    2009.09.09
功能说明:   接口函数
其它说明:   无
*****************************************************************************************/
APP_LED_EXT     void    ConfigureLED(void);

APP_LED_EXT     void    LED_Switch(uint8 key, uint8 status);

APP_LED_EXT     void    LED_FlushScanf(void);




#endif




