/*****************************************************************************************
版权所有:        ---------------
版本号:            1.0.0
生成日期:        2010.05.11
文件名:            app_wdt.c
作者:            影舞者
功能说明:        应用层配置文件
其它说明:        Atmel AT91SAM9G45-EK Evaluation Board
所属文件关系:    本文件为工程规约代码文件

修改记录:
记录1:
修改者:
修改日期:
修改内容:
修改原因:
*****************************************************************************************/

#define  APP_WDT_GLOBALS
#include "app_types.h"
#include "app_wdt.h"
#include "app_kbd.h"


#if (WDT_SUPPORT == 1)   


/*****************************************************************************************
函数名称:    void WDTC_Clear(void)
版本号:        1.0.0
生成日期:    2009.09.08
作者:        影舞者
功能说明:    WDT清除
输入参数:    无
输出参数:    无
其它说明:    无
*****************************************************************************************/
void WDTC_Clear(void)
{
#if (WDT_SUPPORT == 1)    
    IWDG_ReloadCounter();
#endif    
}




/*****************************************************************************************
函数名称:    void WDTC_Message(void)
版本号:        1.0.0
生成日期:    2009.09.08
作者:        影舞者
功能说明:    WDT清除
输入参数:    无
输出参数:    无
其它说明:    无
*****************************************************************************************/
void  WDTC_Message(char *message)
{
#if (DEBUG_SUPPORT == 1)
    #if (KEY_SUPPORT == 1)
        if (KBD_GetPinLevelValue(KEY_HAL_FEED) == 0)
    	    APP_printf("%s", message);
    #endif    
#endif
}




/*****************************************************************************************
函数名称:    void WWDG_IRQHandler(void)
版本号:        1.0.0
生成日期:    2009.09.08
作者:        影舞者
功能说明:    WDT清除
输入参数:    无
输出参数:    无
其它说明:    无
*****************************************************************************************/
void WWDG_IRQHandler(void)
{
    #if (DEBUG_SUPPORT == 1)
        APP_printf("\n\r WDT_IRQHandler... ");
    #endif
}




/*****************************************************************************************
函数名称:    void ConfigureWDTC(void)
版本号:        1.0.0
生成日期:    2009.09.08
作者:        影舞者
功能说明:    WDT配置参数
输入参数:    无
输出参数:    无
其它说明:    无
*****************************************************************************************/
void ConfigureWDTC(void)
{
#if (DEBUG_SUPPORT == 1)
    APP_printf("\n\r ConfigureWDT... ");
#endif

    // 3秒
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
    IWDG_SetPrescaler(IWDG_Prescaler_32);
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Disable);

    // 启动
    IWDG_Enable();
}


#endif


