
#ifndef __F016BDRV_H 
#define __F016BDRV_H




#define INT32U   uint32_t
#define INT16U   uint16_t
#define INT8U    uint8_t


typedef enum ERTYPE{
    Sec1,
    Sec8,
    Sec16,
    Chip
} ErType;  

typedef enum IDTYPE{
    Manu_ID,
    Dev_ID,
    Jedec_ID
} idtype;


#define MAX_ADDR            0x1FFFFF                                    /* 定义芯片内部最大地址         */
#define SEC_MAX             512                                         /* 定义最大扇区号               */
#define SEC_SIZE            0x1000                                      /* 扇区大小                     */


/*********************************************************************************************************
** 函数名称：SPIInit
** 功能描述：初始化MCU与SST25VF016B芯片的控制和通讯接口
** 输入参数：无
** 输入参数：无
** 返 回 值：无
*********************************************************************************************************/
extern  void  SSP_Init(void);


/*********************************************************************************************************
** 函数名称:MX25L1602_RdID
** 函数功能:MX25L1602的读ID函数,可选择读ID和读数据操作
** 输入参数:
**          idtype IDType:ID类型。用户可在Jedec_ID,Dev_ID,Manu_ID三者里选择
**          uint32* RcvbufPt:存储ID变量的指针
** 输出参数:操作成功则返回TRUE,失败则返回FALSE
** 特殊说明:若填入的参数不符合要求，则返回FALSE
*********************************************************************************************************/
extern   INT8U MX25L1602_RdID(idtype IDType, INT32U* RcvbufPt);


/*********************************************************************************************************
** 函数名称:MX25L1602_RD
** 函数功能:MX25L1602的读函数,可选择读ID和读数据操作
** 输入参数:
**          uint32 Dst：目标地址,范围 0x0 - MAX_ADDR（MAX_ADDR = 0x1FFFFF）
**          uint32 NByte:  要读取的数据字节数
**          uint8* RcvBufPt:接收缓存的指针
** 输出参数:操作成功则返回TRUE,失败则返回FALSE
** 特殊说明:若某功能下,某一入口参数无效,可在该入口参数处填Invalid，该参数将被忽略
**********************************************************************************************************/
extern   INT8U MX25L1602_RD(INT32U Dst, INT8U* RcvBufPt, INT32U NByte);


/*********************************************************************************************************
** 函数名称:SSTF016B_WR
** 函数功能:SST25VF016B的写函数，可写1个和多个数据到指定地址
** 输入参数:
**         uint32 Dst：目标地址,范围 0x0 - MAX_ADDR（MAX_ADDR = 0x1FFFFF）
**         uint8* SndbufPt:发送缓存区指针
**         uint32 NByte:要写的数据字节数
** 输出参数:操作成功则返回TRUE,失败则返回FALSE
** 特殊说明:若某功能下,某一入口参数无效,可在该入口参数处填Invalid，该参数将被忽略
*********************************************************************************************************/
extern   INT8U MX25L1602_WR(INT32U Dst,INT8U* SndbufPt,INT32U NByte);


/********************************************************************************************************
** 函数名称:SSTF016B_Erase
** 函数功能:根据指定的扇区号选取最高效的算法擦除
** 输入参数:
**          uint32 sec1：起始扇区号,范围(0~499)
**          uint32 sec2：终止扇区号,范围(0~499)
** 输出参数:操作成功则返回TRUE,失败则返回FALSE
*********************************************************************************************************/
extern  INT8U MX25L1602_Erase(INT32U sec1, INT32U sec2);

#endif



